/**
 * @fileoverview 模板的config
 * @author xinyu@staff.sina.com.cn
 */


scope.theme_cnf = {
    "0": {
        name: '最新',
        data: ["8_52","33_2","33_5","8_51","8_50","8_49","3_34","3_35","3_36","3_37", "10_86", "10_87", "10_88", "10_82","10_81","10_80","10_79","10_78","10_77","10_76","10_75","10_74","10_73","10_72","16_10","17_12","17_13","17_14","1_31","2_31","2_32","3_32","3_33","4_21","4_22","4_23","5_21","6_21","7_26","8_43"], //,"17_5","17_6","17_7","17_8","17_9","17_10"
        names: ["365","心在山水间", "剪纸系列·忧国忧民", "七周年","记事本","msn模版","粉蓝宝宝", "明媚宝宝", "我爱开车", "彩虹天使", "世博芬兰馆", "世博意大利馆", "世博新加坡馆", "世博瑞典馆","世博非洲馆","世博澳大利亚馆","世博香港馆","世博法国馆","世博英国馆","世博德国馆","世博巴西馆","世博中国馆","世博日本馆","世博美国馆","思源-甘泉行动","墙外春色","虎虎生威","富态","贺岁","老爷车","独唱","拉手","猫","彩","无名","toy","夜色小路","概念","偷看","丢三落四"] //, "航天梦想" ,"东方之珠" ,"金色十月" ,"金色向日葵" ,"放飞梦想" ,"祖国花朵"
    },
    "1": {
        name: '人文',
        data: ["1_1", "1_10", "1_11", "1_12", "1_13", "1_14", "1_15", "1_16", "1_17", "1_18", "1_19", "1_2", "1_20", "1_21", "1_22", "1_23", "1_24", "1_25", "1_26", "1_27", "1_28", "1_29", "1_3", "1_30", "1_4", "1_5", "1_6", "1_7", "1_8", "1_9"],
        names: ["忆江南", "西部风情", "郁金香", "拼图", "墨竹", "力量", "鼠小弟", "甜蜜蜜", "街灯", "红", "飘雪", "轻描淡写", "青春", "禅", "阶梯", "普罗旺斯", "黑色幽默", "邂逅", "古韵", "梦露", "残荷听雨", "花间词", "亭亭玉立", "文艺复兴", "蝶恋花", "雨荷", "人面桃花", "贵妃醉酒", "点滴", "等待"]
    },
    "2": {
        name: '娱乐',
        data: ["2_1", "2_10", "2_11", "2_12", "2_13", "2_14", "2_15", "2_16", "2_17", "2_18", "2_19", "2_2", "2_20", "2_21", "2_22", "2_23", "2_24", "2_25", "2_26", "2_27", "2_28", "2_29", "2_3", "2_30", "2_4", "2_5", "2_6", "2_7", "2_8", "2_9"],
        names: ["涂鸦", "鲸鱼金鱼", "民间艺术", "百鸟图", "万花筒", "月半弯", "方向", "迷藏", "蜜蜂战队", "机器娃娃", "粉日", "蝶殇", "装甲奇兵", "品味人生", "凝视", "音乐之家", "花火", "童话城堡", "听海", "满载而归", "和平", "音乐咖啡", "音乐地带", "极限滑板", "多彩青春", "NANA", "红粉佳人", "紫色诱惑", "迷乱", "疯狂乐队"]
    },
    "3": {
        name: '情感',
        data: ["3_34","3_35","3_36","3_37","3_1", "3_10", "3_11", "3_12", "3_13", "3_14", "3_15", "3_16", "3_17", "3_18", "3_19", "3_2", "3_20", "3_21", "3_22", "3_23", "3_24", "3_25", "3_26", "3_27", "3_28", "3_29", "3_3", "3_30", "3_4", "3_5", "3_6", "3_7", "3_8", "3_9"],
        names: ["粉蓝宝宝", "明媚宝宝", "我爱开车", "彩虹天使","我们", "等待", "猫趣", "渴望", "沉思", "蝶恋书香", "海的女儿", "stella", "幽兰", "伤心往事", "雨中情", "雏菊", "小夜曲", "躲猫猫", "水韵", "寂寞钢琴", "石头记", "花瓣雨", "滋润", "冬日恋歌", "绽放", "纯洁", "伤逝", "叶脉人生", "飘", "半支烟", "悠长假期", "魔镜", "邂逅", "岁月"]
    },
    "4": {
        name: '青春',
        data: ["4_1", "4_10", "4_11", "4_12", "4_13", "4_14", "4_15", "4_16", "4_17", "4_18", "4_19", "4_2", "4_20", "4_3", "4_4", "4_5", "4_6", "4_7", "4_8", "4_9"],
        names: ["单车恋人", "马戏团", "守望", "少女情怀", "悲伤气球", "野蛮丫头", "方脸猫", "单车岁月", "紫色心情", "向前冲", "彩色青春", "童年记忆", "饭团", "颓废", "常春藤", "祝福", "可爱奶瓶", "思念", "童话城堡", "学生时代"]
    },
    "5": {
        name: '自然',
        data: ["5_1", "5_10", "5_11", "5_12", "5_13", "5_14", "5_15", "5_16", "5_17", "5_18", "5_19", "5_2", "5_20", "5_3", "5_4", "5_5", "5_6", "5_7", "5_8", "5_9"],
        names: ["黄昏", "流沙", "浩瀚星空", "落日余晖", "新绿", "雾林", "孤帆远影", "等你", "雨后彩虹", "远山呼唤", "翠鸟", "原上草", "白桦林", "一米阳光", "生命之源", "夕阳西下", "林海雪原", "家", "晨曦", "守望"]
    },
    "6": {
        name: '运动',
        data: ["6_1", "6_10", "6_11", "6_12", "6_13", "6_14", "6_15", "6_16", "6_17", "6_18", "6_19", "6_2", "6_20", "6_3", "6_4", "6_5", "6_6", "6_7", "6_8", "6_9", "12_1", "12_2", "12_3", "12_4", "12_5", "12_6", "12_7", "12_8", "12_9", "12_10", "12_11", "12_12", "12_13", "12_14", "12_15", "12_16", "12_17", "12_18", "12_19", "12_20", "12_21", "12_22", "12_23", "11_43"],
        names: ["垂直极限", "城市穿行", "冲刺", "搏", "舞动奇迹", "跃", "舞动", "滑雪", "拉力赛", "跋山涉水", "三分球", "征服", "篮球火", "超越极限", "奔", "大灌篮", "雪山之巅", "排球女将", "绿荫场", "速度", "紫金", "运动之光", "自由飞翔", "如鱼得水", "熊猫滚滚", "九龙壁", "矫捷", "沙燕", "文明志愿者1", "文明志愿者2", "文明志愿者3", "文明志愿者4", "群星闪耀", "力争上游", "更高更强", "沉着精准", "力与美", "优美弧圈", "扣杀", "水世界", "抉择", "跨越", "力发千钧", "盛夏激情"]
    },
    "7": {
        name: '动漫',
        data: ["7_24","7_25","7_1", "7_10", "7_11", "7_12", "7_13", "7_14", "7_15", "7_16", "7_17", "7_18", "7_19", "7_2", "7_20", "7_3", "7_4", "7_5", "7_6", "7_7", "7_8", "7_9"],
        names: ["跟着博主有肉吃","异想小宇宙","女法师", "花仙子", "可爱公主", "灰色空间", "独眼大盗", "小鸡快跑", "穷开心", "玛丽兄弟", "蓦然回首", "仰望", "幸福", "欢乐泡泡", "狮鹫骑士", "一个人", "海风", "憧憬", "天空之城", "木偶奇遇", "玛丽救美", "好朋友"]
    },
    "8": {
        name: "其他",
        data: ["8_51","8_50","8_49","7_23","8_1", "8_10", "8_11", "8_12", "8_13", "8_14", "8_15", "8_16", "8_17", "8_18", "8_19", "8_2", "8_20", "8_21", "8_22", "8_23", "8_24", "8_25", "8_26", "8_27", "8_28", "8_29", "8_3", "8_30", "8_4", "8_5", "8_6", "8_7", "8_8","14_1", "14_2", "14_3"],
        names: ["七周年","记事本","msn模版","一起去圣诞","雷锋精神", "依偎", "彩虹天堂", "大众", "平安祝福", "蝶恋", "圣诞雪人", "火柴女孩", "爱的咖啡", "云端", "小精灵", "陶醉", "交错", "许愿瓶", "香车美女", "鲸之恋", "生活", "旅程", "风雪无阻", "绿光", "化蝶", "雪娃娃", "温馨圣诞", "威廉古堡", "樱桃", "年年有余", "整装待发", "海豚湾", "窗外", "海军1", "海军2", "海军3"]
    },
    "13": {
        name: '炫动',
        data: ["13_1", "13_2", "13_3", "13_4", "13_5", "13_6", "13_7", "13_8", "13_9", "13_10", "13_11", "13_12", "13_13", "13_14", "13_15", "13_16", "13_17", "13_18", "13_19", "13_20"],
        names: ["化妆", "快拍", "冬雪", "夏夜", "故事1", "故事2", "熊猫滚滚", "静悄悄", "小憩", "四季", "天使", "微笑", "未来", "校园", "雪原", "路灯下", "呼唤", "禁止放屁", "那年回忆", "海之心"]
    },
    "16": {
        name: "财经",
        data: ["16_1", "16_2", "16_3", "16_4", "16_5", "16_6", "16_7", "16_8", "16_9"],
        names: ["向上", "钱袋", "迎接涨停", "线上人生", "股市波浪", "行情版", "趋势", "意见领袖", "财富时光"]
    },
    "17": {
        name: '<span class="winnerTpl">获奖模板</span><img width="15" height="15" align="top" title="新" src="http://simg.sinajs.cn/blog7style/images/common/sg_trans.gif" class="SG_icon SG_icon11">',
        data: ["33_2", "33_5", "33_3", "33_1", "33_4", "33_6","33_7", "33_8", "33_9", "33_10", "33_11", "33_12", "33_13", "33_14", "33_15", "33_16"],
        names: ["心在山水间", "剪纸系列·忧国忧民", "美人如花隔云端", "宁静乡村", "向青春致敬", "七年成长", "篱笆墙", "美丽的相遇", "晒月光", "中国风", "古逸", "梅", "藕花深处，争渡", "墨画风格", "宁静致远", "月圆中秋"]
    }
};

//在IE6下导航图定义了透明png的模版
scope.ie6filter='1_1|1_2|1_3|1_4|1_5|1_6|1_7|1_8|1_10|1_11|1_12|1_22|1_23|1_24|1_28|1_30|10_49|10_50|10_51|10_54|10_57|12_1|12_2|12_3|12_4|12_5|12_7|12_8|12_9|12_10|12_11|12_12|12_13|12_14|12_15|12_16|12_17|12_18|12_20|12_21|12_22|12_23|14_3|16_1|16_2|16_5|17_10|2_1|2_3|2_5|2_6|2_8|2_9|2_10|2_11|2_12|2_13|2_14|2_15|2_20|2_23|2_28|2_29|2_30|3_4|3_5|3_6|3_7|3_8|3_9|3_10|3_13|3_14|3_15|3_18|3_19|3_21|3_26|3_27|3_30|30_1|30_2|30_3|30_4|30_5|30_6|30_7|30_8|30_9|30_10|31_1|31_2|31_3|31_4|31_6|31_7|31_8|31_9|32_1|32_2|32_3|32_4|32_5|32_7|32_8|32_9|32_10|4_1|4_2|4_3|4_5|4_10|4_17|4_20|5_6|5_7|5_8|5_9|5_10|5_11|5_17|6_5|6_6|6_9|6_10|6_14|6_19|7_1|7_2|7_3|7_7|7_8|7_13|7_14|7_15|7_20|8_2|8_5|8_8|8_13|8_15|8_16|8_31|8_33|8_34|8_36|8_41|8_42';

//选择以下模板 用户不能进行自定义
scope.cannot_users=[
	"8_31","8_32","8_33","8_34","8_52",
	
	//世界杯模板
	"11_43",
	
	//育儿模板
	"3_34","3_35","3_36","3_37"
];




// scope.bussiness_conf = ['10_41'];//绑定商业化组件的模板
scope.overdue_theme_cnf = ["10_49","10_1", "10_2", "10_3", "10_4", "8_36", "10_5", "10_6", "10_7", "10_8", "10_9", "10_10", "10_11", "10_17", "10_28", "10_29", "10_30", '10_37', '15_1','10_57','10_59','10_60','10_61'];
scope.colorSort = {
    "1": {
        name: '纯色',
        base: 'colorclass',
        pic: ['color001', 'color002', 'color003', 'color004', 'color005', 'color007', 'color008', 'color009', 'color010', 'color011', 'color012'],
        data: ['32_1', '32_2', '32_3', '32_4', '32_5', '32_7', '32_8', '32_9', '32_10', '32_11', '32_12'],
        names: ["嘿嘿"]
    },
    "2": {
        name: '炫色',
        base: 'mcolorclass',
        pic: ['color001', 'color002', 'color003', 'color004', 'color005', 'color006', 'color007', 'color008', 'color009', 'color010'],
        data: ['30_1', '30_2', '30_3', '30_4', '30_5', '30_6', '30_7', '30_8', '30_9', '30_10'],
        names: ["嘿嘿"]
    }
};


scope.guide_conf = {
    "1": {
        name: '财经型',
        format: 2,
        preview: 'http://simg.sinajs.cn/blog7style/images/common/topsetting/guide1.jpg',
		previewnew: 'http://simg.sinajs.cn/blog7style/images/common/topsetting/nguide1.jpg',
        data: ["16_8", "16_7", "16_4", "16_1", "8_7", "5_18", "5_3", "5_1","3_30", "2_29", "1_19", "1_1"],
		names: ["意见领袖", "趋势", "线上人生", "向上", "海豚湾", "远山呼唤", "一米阳光", "黄昏", "叶脉人生", "音乐咖啡", "飘雪", "忆江南"],
        comp: [88,90,89,91,10006],
        compnames: {"88":"全球股市","90":"黄金原油","89":"汇市走势","91":"基金回报排行", "10006":"财经要闻"}
    },
    "2": {
        name: '图片型',
        format: 2,
        preview: 'http://simg.sinajs.cn/blog7style/images/common/topsetting/guide2.jpg',
		previewnew: 'http://simg.sinajs.cn/blog7style/images/common/topsetting/nguide2.jpg',
        data: ["8_4", "5_7", "5_4", "4_2", "4_6", "4_18", "3_11", "3_4","1_13", "1_10", "1_20", "2_5"],
		names: ["樱桃", "家", "生命之源", "童年记忆", "可爱奶瓶", "学生时代", "猫趣", "飘", "墨竹", "断背山", "青春", "NANA"],
		comp: [10004],
        compnames: {"10004":"图片播放器"}
    },
    "3": {
        name: '日记型',
        format: 4,
        preview: 'http://simg.sinajs.cn/blog7style/images/common/topsetting/guide3.jpg',
		previewnew: 'http://simg.sinajs.cn/blog7style/images/common/topsetting/nguide3.jpg',
        data: ["4_10", "3_18", "3_15", "3_1", "2_25", "2_19", "2_17", "2_15","2_10", "2_1", "1_21", "1_12"],
		names: ["马戏团", "伤心往事", "海的女儿", "我们", "童话城堡", "粉日", "蜜蜂战队", "方向", "鲸鱼金鱼", "涂鸦", "禅", "拼图"],
        comp: [],
        compnames: {}
    },
    "4": {
        name: '传统型',
        format: 1,
        preview: 'http://simg.sinajs.cn/blog7style/images/common/topsetting/guide4.jpg',
		previewnew: 'http://simg.sinajs.cn/blog7style/images/common/topsetting/nguide4.jpg',
        data: ["1_2", "1_6", "1_7", "1_18", "1_19", "1_25", "1_28", "2_2","2_4", "3_9", "3_21", "4_19"],
		names: ["轻描淡写", "人面桃花", "贵妃醉酒", "红", "飘雪", "邂逅", "残荷听雨", "蝶殇", "多彩青春", "岁月", "躲猫猫", "彩色青春"],
        comp: [],
        compnames: {}
    }
};

//推荐模板
scope.pushTpl_conf = {
	picurl:		'http://simg.sinajs.cn/blog7style/images/center/ad/mhfg.png',
	data:		'33_14',
	text:		'墨画风格'
};

//育儿模板
scope.babyTpl_conf=["3_34","3_35","3_36","3_37"];

//365模版拥有365组件 add by gaolei2
scope.blog365Tpl_conf=["8_52"];
