/** 
 * @fileoverview 纸条相关
 */
$import("lib/msg/systemMSG.js");
$SYSMSG.extend({
	"A20001" : "纸条内容必须是150中文或300字符以内，请重新输入。",
	"A20002" : "登录名和密码不匹配，请重新输入。",
	"A20003" : "验证码错误，请重新输入。",
	"A20004" : "不能包含sina等特殊含义字符，请重新输入。",
	"A20005" : "请输入内容。",
	"A20101" : "内容字数必须是150中文和300字符内，请重新输入。",
	"A20102" : "登录名和密码不匹配，请重新输入。",
	"A20103" : "验证码错误，请重新输入。",
	"A20104" : "请把对方在黑名单中解除，再加为好友。",
	"A20105" : "已达好友数上限，不能继续添加。",
	"A20106" : "对方设置不接收好友邀请，不能加为好友。",
	"A20107" : "不能与自己为好友。",
	"A20108" : "你们已经是好友。",
	"A20008" : "对不起，您短时间发表的纸条过多，请多休息会，注意身体！感谢您对新浪博客的支持和关注!"
});