/**
 * @fileoverview 手机订阅状态码
 * @author dg.liu | dongguang@staff.sina.com.cn
 * @created 2009-11-11
 */
$import("lib/sysmsg.js");
$SYSMSG.extend({
    "B24001": "未同意服务条款",
    "B24002": "你输入的手机号有误，请重新输入。",
    "B24003": "你输入的验证码有误，请重新输入。<br/>若忘记验证码，可重新获取。",
    "B24004": "此博客已绑定手机号",
    "B24005": "此手机号已绑定博客",
    "B24006": "你输入的手机号或验证码有误，请重新输入。<br/>若忘记验证码，可重新获取。",
    "B24007": "此博客未开通手机订阅",
    "B24008": "被访问者uid错误",
    "B24009": "自己不能订阅自己",
    "B24010": "你已手机订阅此用户。",
    "B24011": "抱歉！你的手机订阅用户数已达上限，手机订阅失败。",
    "B24012": "自己不能取消自己",
    "B24013": "此用户未被订阅",
    "B24014": "手机关注订阅失败！",
    "B24015": "确定要取消对他的手机订阅吗？",
    
    //常川添加于2010-08-10
    "B24017": "抱歉！您所在的地区暂不支持此服务。",
    "B24018": "抱歉！系统繁忙，请稍后再试。",
    "B24019": "抱歉！您输入的手机号码错误，请重新输入。",
    "B24020": "抱歉！系统繁忙，请稍后再试。",
    "B24021": "抱歉！为防止用户恶意骚扰，您今天尝试开通的次数已达上限。",
    "B24022": "手机绑定但是没有开通，点击确定后将返回个人中心。"
});

