/**
 * @fileoverview 举报的文案
 * @author Random | YangHao@staff.sina.com.cn
 * @created 2010-01-19
 */

$import("lib/sysmsg.js");
$SYSMSG.extend({
	"B04102" : "您输入的电子邮件格式错误，请重新输入",
	"B04105" : "很抱歉，您输入的内容过多，请删减后重新提交",
	"B04107" : "您要举报的内容已经不存在，感谢您的支持",
	"B04108" : "举报分类错误",
	"B04109" : "您还没有选择举报类别，请选择后继续操作",
	"B04110" : "您的昵称为空，请输入后继续操作",
	"B04111" : "系统繁忙，请稍后再试",//"fuid为空",
	"B04112" : "您已经举报过该用户，再次感谢您的支持",
	"B04113" : "系统繁忙，请稍后再试",//"数据库标识id为空",
	"B04114" : "系统繁忙，请稍后再试",//"举报人uid为空",
	"B04115" : "系统繁忙，请稍后再试",//"举报人nickname为空",
	"B04116" : "系统繁忙，请稍后再试"//"接口到uid和session中uid不一致"
});