/**
 * 修改头像
 * @author dg.liu 2008.10.29
 */
$import("lib/sysmsg.js");
$SYSMSG.extend({
	"AC0000" : "保存失败，请重试。",
	"AC0001" : "保存失败，请重试。",
	"AC0002" : "保存失败，请重试。",
	"A77001" : "昵称必须为4-30个字符,支持中英文，数字，'_'或减号,请重新输入。",
	"A77002" : "昵称必须为4-30个字符,支持中英文，数字，'_'或减号,请重新输入。",
	"A77003" : "呢称不能为空，请输入呢称。",
	"A77004" : "不能包含sina等特殊含义字符。",
	"A77005" : "你的图片文件超出2M，请选择较小的图片。",
	"1101"   : "昵称必须为4-30个字符,支持中英文，数字，'_'或减号,请重新输入。",
	"1102"   : "昵称必须为4-30个字符,支持中英文，数字，'_'或减号,请重新输入。",
	"1103"   : "昵称不能为全数字",
	"1201"   : "昵称含有不允许的词汇",
	"1301"   : "此昵称太受欢迎,已有人抢了",
	"3001"   : "当前没有用户登录",
	"3002"   : "查询的用户与当前登录用户不一致",
	"9001"   : "接口自身系统错误（验证失败）",
	"9002"   : "Cookie 配置文件读取失败"
});
