/*
 * Copyright (c) 2007, Sina Inc. All rights reserved. 
 */
/** 
 * @fileoverview 系统 - 系统报错
 */
$import("lib/sysmsg.js");
$SYSMSG.extend({
	"B00007" : "跳转到自动开通页", 
	"B00008" : "自动开通用户(跳转到假页)",   
	"B00009" : "跳转到自动开通页",     
	"B00010" : "无权限。 ",
	"B00011" : "抱歉，Blog ID 错误，操作无法完成。",
	"B00012" : "抱歉，可能因为重复操作而无法执行，请刷新本页再试。",
	"B00013" : "用户ID被封杀",
	"B00014" : "很抱歉，您输入的验证码不正确。",
	"B04101" : "请输入您的昵称！",
	"B04102" : "请正确输入您的邮件地址！",
	"B04103" : "请选择您举报信息的位置！",
	"B04104" : "请选择您举报的不良信息的类型！",
	"B04105" : "简单描述最多只能输入500个字符！",
	"B04106" : "再次感谢您帮助我们进行不良信息的验证工作，我们将认真仔细地处理您提交的内容。",
	"B07006" : "您已发的博文正在审查中，请稍后再发文"
});