/**
 * @author Random | YangHao@staff.sina.com.cn
 * @description 留言页相关状态码
 */

$GUESTBOOK_MSG={
	"A00001"	: "操作失败，可能系统繁忙或系统遇到未知错误，请稍后再试。也可联系新浪客服：致电4006900000。",
	"A00002"	: "此帐号暂时被封，如有疑问也可联系新浪客服：致电4006900000。",
	"A00003"	: "无权限进行此操作，请重新登录。",
	"A00004"	: "不能包含Sina等特殊含义字符。",
	"A00005"	: "操作失败，可能系统繁忙或系统遇到未知错误，请稍后再试。也可联系新浪客服：致电4006900000。",
	"A00006"	: "操作成功",
	"A00007"	: "无权限进行此操作，请重新登录。",
	"A00101"	: "留言板非公开。",
	"A00102"	: "不能回复自己的留言。",
	"A00103"	: "验证码不正确",
	"A00104"    : "对不起，您短时间发表的留言过多，请多休息会，注意身体！感谢您对新浪博客的支持和关注！",
	"A00105"    : "请把对方从黑名单中解除，再发表留言。",
	"A11007"	: "未开通博客。",
    "A20013"    : "您已经发送多条相似内容了哦，请先休息一下吧~",
	"A20014"    : "已经有很多博主发过相似评论了，换个内容会更精彩~",
    "A20015"    : "发生错误，请稍作休息~",
	"B00013"	: "系统繁忙。",
	"A00106"	: "对方拒绝了您的留言！"
};

$GUESTBOOKLOGIN_MSG={
	"A19002"	: "登录名和密码不匹配，请重新输入。",
	"A19004"	: "请输入验证码。",
	"A19005"	: "验证码错误，请重新输入。",
	"A19006"	: "请输入登录名。",
	"A19007"	: "请输入密码。",
	"A19008"	: "此登录帐户尚未确认。请直接去邮箱进行确认此帐户<br/>或<a href=\"http://login.sina.com.cn/hd/resend.php\" target=\"_blank\">重发确认信</a>。",
	"A19009"	: "登录名不存在，请重新输入。"
};
