/**
 * 评论相关状态码，包括评论发表、读取、删除、回复、评论管理页等
 * @author L.Ming | liming1@staff.sina.com.cn
 * @since 2008-09-20
 */
$import("lib/sysmsg.js");

$SYSMSG.extend({
    "B36001": "操作失败，此博文不存在或被删除。",
    "B36002": "验证码错误，请重新输入。",
    "B36003": "请输入昵称。",
    //"B36004": "昵称必须是8个中文或16个字符以内，且不能为纯数字，请重新输入。",
	"B36004": "登录名或密码错误。",
    "B36005": "呢称不能使用此类特殊词汇，请重新输入。",
    "B36006": "昵称必须是8个中文或16个字符以内，且不能为纯数字，请重新输入。",
    //"B36006": "登录名或密码错误。",
	"B36007": "呢称不能使用此类特殊词汇，请重新输入。",
    "B36008": "不能3秒内连续发评论，请梢后再试。",
    
    "B36009": "不能发内容重复的评论。",
    
    "B36020": "暂无评论。",
    "B36021": "暂无评论。",
    "B36022": "评论内容必须是1000中文或2000字符以内，请重新输入。",
	"B36023": "对不起，黑名单已达到上限",
	"B36024": "对方拒绝了你的评论。",
    
    "B36031": "操作失败，此评论不存在或被删除。",
    "B36032": "操作失败，此评论不存在或被删除。",
    "B36033": "操作失败，此评论不存在或被删除。",
    
    "B36041": "请输入回复内容。",
    "B36042": "回复内容必须是1000中文或2000字符以内，请重新输入。",
    "B36043": "操作失败，自己不能回复自己的评论。",
    
    "B36101": "操作失败，此博文不存在或被删除。",
    "B36102": "评论发布失败，此博文设置不允许评论。",
    "B36103": "操作失败，此评论不存在或被删除。",
    "B36104": "评论已发布，需要审核后才能显示，请稍候…",
	"B36113": "博主已关闭匿名评论，请登录后再评论",
    
    "B36105": "请输入评论内容。",
    "B36106": "请输入验证码。",
    "B36107": "请输入登录名。",
    "B36108": "请输入密码。",
    "B36109": "读取中，请稍候…",
    "B36110": "读取失败，请刷新。",
    "B36111": "确定要删除此评论吗？删除后不可恢复。",
    "B36112": "确定要删除此回复吗？删除后不可恢复。",
    "B36115": "请拖动滑块儿开始验证",
    
    "B36201": "确定要删除此评论吗？删除后不可恢复。",
    "B36202": "确定要删除此回复吗？删除后不可恢复。",
    "B36203": "请选择要删除的内容。",
    "B36204": "已回复该评论，请勿重复提交。",
	"B36998": "系统维护中，服务暂不可用。",
    "B36999": "对不起，您短时间发表的留言过多，请多休息会，注意身体！感谢您对新浪博客的支持和关注！",
    "36999": "对不起，您短时间发表的留言过多，请多休息会，注意身体！感谢您对新浪博客的支持和关注！",
	"B90001": "抱歉，该文章不允许评论。",
	"A20013": "您已经发送多条相似内容了哦，请先休息一下吧~",
	"A20014": "已经有很多博主发过相似评论了，换个内容会更精彩~",
    "B36205": "请登录后在回复评论",
    "B36206": "对不起，您已被对方列入黑名单，无法发评论。",
    "B36207": "请登录后在删除评论",
    "B36208": "评论内容必须是140中文或280字符以内，请重新输入",
    "B36209": "此条评论已被原博主删除",
    "B36210": "博主已关闭评论功能",
    "B36211": "此博文已被博主设为私密",
    "A00004": "此评论不存在或已被博主删除"
});
