/**
 * @fileoverview
 *	好友邀请功能状态码 & 文案
 * @author L.Ming | liming1@staff.sina.com.cn
 * @version 1.0
 * @history
 *
 */
$import("lib/sysmsg.js");
$SYSMSG.extend({
	"A00001"	: "系统繁忙，请稍候再试。",
	"A00007"	: "请先登录。",
	"A20101"	: "内容超长。",
	"A20102"	: "请输入正确的登录名或密码。",
	"A20103"	: "请输入正确的验证码。",
	"A20104"	: "请把对方在黑名单中解除，再加为好友。",
	"A20105"	: "你的好友数量达到上限，不能添加新好友。",
	"A20106"	: "对方设置不接受好友邀请，不能加为好友。",
	"A20107"	: "不能加自己为好友。",
	"A20108"	: "你们已经是好友。",
	"A20109"	: "不能包含sina等特殊含义字符。",
	"A20121"	: "参数格式不正确。",
	"A20000"	: "参数格式不正确。",
	"A20001"	: "内容超长。",
	"A20002"	: "请输入正确的登录名或密码。",
	"A20003"	: "请输入正确的验证码。",
	"A20004"	: "不能包含sina等特殊含义字符。",
	"A20005"	: "纸条内容不能为空。",
	"A20006"	: "不能自己给自己发纸条",
	"A20007"	: "请把对方在黑名单中解除，再发送纸条。",
	"A20020"	: "给#{nick}的纸条发送失败！",
	"A20008"	: "对不起，您短时间发表的纸条过多，请多休息会，注意身体！感谢您对新浪博客的支持和关注!",
	"A10000"	: "不能加自己为好友。",
	"A10001"	: "对方的好友数量达到上限，不能添加新好友。",
	"A10002"	: "黑名单用户",
	"A10003"	: "对方设置不接受好友邀请，不能加为好友。",
	"A10004"	: "你们已经是好友。",
	"A10016"	: "对方拒绝加为好友",
	
	"A11007"	: "非博客用户。",
	"A30001"	: "添加好友失败。",
	"A30002"	: "部分好友添加成功。"
});