/**
 * @fileoverview
 *	公共状态码 & 文案
 * @author L.Ming | liming1@staff.sina.com.cn
 * @version 1.0
 * @history
 *
 */
$import("lib/sysmsg.js");
$SYSMSG.extend({
	 "A00001"	: "操作失败，可能系统繁忙或系统遇到未知错误，请稍后再试。也可联系新浪客服：致电4006900000。"
	,"A00002"	: "很抱歉，您的IP出现异常，请稍后再试" //"此帐号暂时被封，如有疑问也可联系新浪客服：致电4006900000。"
	,"A00003"	: "无权限进行此操作，请重新登录。"
	,"A00004"	: "无权限进行此操作，请重新登录。"
	,"A00005"	: "操作失败，可能系统繁忙或系统遇到未知错误，请稍后再试。也可联系新浪客服：致电4006900000。"
	,"A00006"	: "操作成功"
	,"A00007"	: "无权限进行此操作，请重新登录。"
	,"A00009"	: "网络繁忙，请稍后再试"
	,"A00010"	: "无升级权限"
	,"A11007"	: "你还未开通新浪博客，请先<a href='http://login.sina.com.cn/hd/reg_sec.php?entry=blog'> 开通博客</a>"
    ,"A00800"   : "对不起，您短时间点击喜欢过多，请多休息，注意身体！感谢您对新浪博客的支持和关注！"
});