/**
 * 未开通博客用户开通博客
 * @author zhihan@staff.sina.com.cn
 * @since 2010-01-11
 */

$import("lib/sysmsg.js");
$SYSMSG.extend({
    "A00001" : "系统繁忙，请稍候再试。",
	"A00007" : "未登录。",
	"A00004" : "系统繁忙，请稍候再试。",
	"A00112" : "博客名称超长。",
	"A00113" : "您已开通博客，请点击<a href='http://control.blog.sina.com.cn/blogprofile/index.php'>个人中心</a>进入。",
	"A00116" : "不能包含 sina 等有特殊含义的字符。",
	"A11003" : "此账户已完成博客快速设置，点击确定，直接进入博客。",
	"A44001" : "博客个性地址不能为空。",
	"A44002" : "地址格式不对。",
	"A44003" : "抱歉，此地址已被占用。",
	"A44005" : "抱歉，请按照正确格式填写博客地址。"
});


