/*
 * Copyright (c) 2007, Sina Inc. All rights reserved. 
 */
/** 
 * @fileoverview 文章管理 - 报错
 */
$import("lib/sysmsg.js");
$SYSMSG.extend({
	"B03020"	: "博文已收藏成功！",
	"B03002"	: "已达收藏数2000条上限，不能继续收藏。",
	"B03004"	: "已收藏过此博文，不能重复收藏。",
	"B03005"	: "确实要取消此收藏吗？",
	"B03006"	: "确实要删除此博文吗？删除后可在“回收站”恢复。",
	"B03007"	: "确实要删除此草稿吗？删除后不可恢复。",
	"B03008"	: "确实要彻底删除此博文吗？删除后不可恢复。",
	"B03010"	: "确实要替换已置顶的博文吗？",
	"B03011"	: "确实要取消置顶吗？取消后可在“博文”页恢复。",
//	"B03012"	: "复制成功！您可以直接粘贴(ctrl+V)到msn、qq、uc、email等通信工具中发给您的好友。",
//	"B03013"	: "您可以将上面的地址拷贝后发送给好友。",
	"B03014"	: "博文已成功置顶到首页！",
	"B03015"	: "抱歉，您的博客尚未升级，请<a href='http://blog.sina.com.cn/u/#UID' target='_blank'>升级</a>后再“收藏” 。",
	"S01107"	: "已收藏过此博文，不能重复收藏。",
	"B03016"	: "是否要彻底删除此博文？博文删除后不可恢复，博文内图片如被其他博文引用也将无法显示。",
	"B03017"	: "私密博文不能被收藏。",
    "B119000"   : "对不起，您短时间点击收藏过多，请多休息，注意身体！感谢您对新浪博客的支持和关注！"
});
