/**
 * @fileoverview 自定义组件的状态码
 * @author xinyu@staff.sina.com
 */


$SYSMSG.extend({
	"B27000"	: "确实要删除此模块吗？删除后不可恢复。",
	"B27001"	: "操作失败，此模块不存在或被删除。",
	"B27102"	: "操作失败，此数据不存在或被删除。",
	"B27103"	: "暂无内容，请添写。",
	"B27004"	: "是否要保存此更改？",
	
	"B26001"	: "操作失败，此模块不存在或被删除。",
	"B26003"	: "标题必须是8个中文或16个字符以内，请重新输入。",
	"B26004"	: "请输入内容。",
	"B26005"	: "内容必须是4000中文或8000字符以内，请重新输入。",
	"B26101"	: "已达自定义模块数1000个上限，不能继续创建。",
	"B26102"	: "操作失败，此数据不存在或被删除。",
	"B26103"	: "操作失败，此数据不存在或被删除。",
	"B26006"	: "不能使用此类特殊词汇，请重新输入。",
	
	"B28010"	: "链接地址格式错误，请重新输入。",
	"B28001"	: "操作失败，此模块不存在或被删除。",
	"B28003"	: "标题必须是8个中文或16个字符以内，请重新输入。",
	"B28004"	: "请输入链接地址。",
	"B28005"	: "链接地址格式错误，请重新输入。",
	"B28006"	: "请输入链接名称。",
	"B28007"	: "链接名称必须是36个中文或72字符以内，请重新输入。",
	"B28008"	: "请输入链接描述。",
	"B28009"	: "链接描述必须是100个中文或200字符以内，请重新输入。",
	"B28010"	: "链接地址格式错误，请重新输入。",
	
	"B28101"	: "已达自定义模块数1000个上限，不能继续创建。",
	"B28102"	: "操作失败，此数据不存在或被删除。",
	"B28103"	: "操作失败，此类型不存在或被删除。"
	
	
});