/*
 * Copyright (c) 2007, Sina Inc. All rights reserved. 
 */
/** 
 * @fileoverview 奥运项目_许愿瓶
 */
$SYSMSG.extend({
	"B20001": "您最多放入大海100个许愿瓶。",
	"B20002": "抱歉，放入许愿瓶的内容有误。",
	"B20003": "您最多可以捡起100个许愿瓶。",
	"B20004": "请勿在许愿瓶内放入过多内容。",
	"B20005": "您无法捡起此许愿瓶。",
	"B20006": "请填写您要放入许愿瓶的内容。",
	"B20007": "您无法捡起此许愿瓶。",
	"b20007": "您无法捡起此许愿瓶。",
	"001": "请输入登录名。",
	"002": "请输入密码。",
	"003": "请输入验证码。",
	"004": "验证码有误。",
	"005": "登录名或密码有误。",
	"006": "系统繁忙，请稍后再试。",
	"007": "系统繁忙，请稍后再试。",
	"008": "请填写您要放入许愿瓶的内容。"
});