/**
 * @author Random | YangHao@staff.sina.com.cn
 * @description 关注相关状态码
 */

$ATTENTION_MSG={
	"A00001"	: "操作失败，可能系统繁忙或系统遇到未知错误，请稍后再试。也可联系新浪客服：致电4006900000。",
	"A00002"	: "参数错误",
	"A00003"	: "非法操作",
	"A00004"	: "无权限进行此操作，请重新登录。",
	"A00005"	: "输入敏感信息",
	"A00006"	: "操作成功",
	"A33005" 	: "你不能添加自己为关注！",
	"A33001"	: "对方已经被你加为关注了！<br/>请不要重复添加。",
	"A33002"	: "对方拒绝了你的关注请求！",
	"A33003"	: "关注已达上限300，不能再添加新的关注了！<br/>可以到<a target='_blank' href='#{url}'>我关注的人</a>去取消关注一些人，再回来关注吧。",
	"A33004"	: "关注成功!",
	"A33008"	: "取消关注失败<br/>请重试！",
	"A33009"	: "加黑名单失败<br/>请重试！"
};
