/**
 * 游戏合作页的状态码
 * xinyu@staff.sina.com.cn
 */

$import("lib/sysmsg.js");
$SYSMSG.extend({
	"A10040":"该种类型邮箱已经禁止注册，请选择其它类型邮箱注册。",
	"A10038":"邮箱地址错误。",
	"A10031":"密码格式不正确。",
	"A00001":"操作失败。",
	"A10041":"该用户未在游戏网站注册",
	
	// 新加的…
	"21":"用户名长度错误",
	"20":"登录名应为 4－32 位",
	"22":"会员名不能以下划线结尾",
	"30":"登录名应为 4－32 位",
	"31":"用户名长度错误",
	"32":"会员名不能以下划线结尾",
	"130":"昵称应由中文，数字，英文小写字母组成",
	"131":"昵称应为 4－20 位",
	"132":"昵称不能含有不能含有特殊字符",
	"80":"密码只能由数字，英文字母(区分大小写)",
	"81":"密码应为 6-16 位",
	"82":"密码中的下划线不能在最后",
	"4032":"注册邮箱失败",
	"4033":"注册邮箱失败",
	"4036":"用户名已经存在",
	
	// 
	"A2005": "昵称不能为空",
	"A2004": "您的操作可能已经失效，请点击确定返回第一步",		// token 失效
	"A00006": "MSN 和当前登录用户已经绑定",
	"A0089": "你的 MSN 账号已经正常完成搬家了，确认要继续？",
	"A0090": "MSN 未登录，点击确定返回上一步重新登录",
	"A0092": "你的 MSN 账号已经绑定过一个新浪博客账号，继续此操作将撤销你之前的绑定！",
	"A0093": "你登录的博客账号并未开通，点击确定开通博客！",
	
	// 新刚
	"A0099": "你有一个搬家流程正在进行中，请等待完成后再试"
});


