/**
 * @fileoverview
 *	关注功能状态码 & 文案
 * @author L.Ming | liming1@staff.sina.com.cn
 * @version 1.0
 * @history
 *
 */
$import("lib/sysmsg.js");
$SYSMSG.extend({
	 "A33001"	: "对方已经被你加为关注了！<br/>请不要重复添加。"
	,"A33002"	: "对方拒绝了你的关注请求！"
	,"A33003"	: "关注已达上限，不能再添加新的关注了！<br/>可以到<a href='http://control.blog.sina.com.cn/blogprofile/attention.php"
					+ "' target='_blank'>关注的人</a>去取消关注一些人，再回来关注吧。"
	,"A33004"	: "关注成功！"
	,"A33005"	: "你不能添加自己为关注！"
	,"A33008"	: "取消关注失败"
	,"A33009"	: "移除关注成功，加黑名单失败"
	,"A33010"	: "对不起，您短时间添加关注过多，请多休息，注意身体！感谢您对新浪博客的支持和关注！"
	,"A20013"	:"您已经发送多条相似内容了哦，请先休息一下吧~" 
	,"A20014"	: "已经有很多博主发过相似评论了，换个内容会更精彩~"
});